{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 48, 48, 1], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "dtype": "float32", "activation": "relu", "kernel_size": [2, 2], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "data_format": "channels_last", "activation": "relu", "kernel_size": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "units": 1024, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "units": 1024, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "units": 7, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "keras_version": "2.2.2"}